SET_ADMIN_STATUS_MESSAGE = '✅ Пользователь назначен на пост администратора!'

CANCEL_ADMIN_STATUS_MESSAGE = '❌ Пользователь снят с поста администратора!'

INFORMATION_FOR_CHANGE_ADMIN_STATUS_COMMAND = '''
⚠️ Информация:
1. Для назначения пользователя на пост администратора введите /set_admin_status <user_id>
2.  Для снятия пользователя с поста администратора введите /cancel_admin_status <user_id>
'''

USER_NOT_FOUND_MESSAGE = '❗️ Ошибка! Пользователя с таким id не существует!'

ENTER_AD_TEXT_MESSAGE = '📣 Введите текст объявления'

ENTER_PHOTO_MESSAGE = '📸 Хорошо! Теперь отправьте фото для объявления'

ENTER_BUTTON_TEXT_MESSAGE = '⌨️ Введите текст для кнопки'

ENTER_URL_MESSAGE = '🖱 Ещё немного... Введите ссылку для перехода'

WARNING_DATA_SEND_MESSAGE = '❗️ Ошибка! Введите корректные данные'

START_AD_MESSAGE = '📣 Начинаю рассылку объявления'

END_AD_MESSAGE = '✅ Рассылка объявлений завершена'
